{"Recipe_ID":9,"Name":"Double Garlic Spinach Chickin Soup","Link":"Link","Image":"https:\/\/pbs.twimg.com\/profile_images\/1229840659797819392\/ZOdybJZH.jpg","People":"0","ActiveTime":"0","PassiveTime":"0","Rating":"0","Notes":":#","Steps":["Chop onions\nthinly sliver garlic","Pressure cook for 45min, let natural release for at least 10min","In a large pot bring water to boil\nToss all cloves from 2 Heads of Garlic\nScoop out with a slotted spoon, the peels should come off easy. \nReturn all the garlic cloves back into the boil, along with 3 whole cloves. \nSimmer for 15min. Add Sage and Thyme during the last 5min.","Scoop out boiled garlic cloves with a slotted spoon. \nPlace garlic cloves in seive, over the boil and use back of wooden spoon to press the soft garlic through the seive, creating a nice purée.  \nWith the wooden spoon, try to scrape the seive clean of all the precious garlic purée. \nSet seive aside. :) \nReturn stock to simmer, then set aside. Vigorously stir(or whisk) in  1Tbs of EVOO. \nCover pot and set aside.","If Chickpeas are done cooking by now, we can add whatever cooking liquid is leftover (Aqua Faba), to our 1st Garlic Stock. \nDrain the Chickpeas over the stockpot using the garlicky seive. \nVigorously stir(or whisk) in to integrate, and set aside.","Bust out a second large pot, and gently sweat 2 small Onions with 2Tbs EVOO and 1 tsp of salt. \nCover the pot and stir periodically, cook only until onions become translucent and wet, not brown caramellization.","Add 6 medium cloves of garlic, sliced thinly, once the onions are very soft\nstir and cook for another 3-5mins, carefully not letting anything brown\nAdd 4 cups of water to the pot and stir to integrate with onions. \nAdd two whole (or chopped in half) celery stalks to the pot, 2 Bay Leaves. \nBring pot to a boil, then simmer until celery stalk soften (15-20min).","Add chickpeas and a large handfull of chopped Celery leaves and baby-stems (or 1 stalk of celery, finely chopped). \nWith a slotted spoon, scoop the cloves out of the 1st Garlic Stock then add this to the soup on boil. \nBring back to boil. Add all Spinach. \nSimmer for 5min. Add 1Tbs chopped fresh Rosemary Leaves and 1tsp fresh Thyme Leaves. \nSimmer for 5min. Take pot off heat, add another 1Tbs chopped fresh Rosemary Leaves and 2tsp of fresh Thyme Leaves. \nCarefully taste then add salt and msg(i use about 2tsp of  ____ brand) to taste. \nVigorously stir(or whisk)in 1\/4 Cup of EVOO and juice from 1 lemon. \nCover and let soup sit for 10min. \nReady 2 serve with topped some fresh black pepper, bread and butter.\nPyrogyTiger"]}